### **1ì¥. íŒŒì´ì¬ ê¸°ë°˜ì˜ ë¨¸ì‹ ëŸ¬ë‹ê³¼ ìƒíƒœê³„ ì´í•´**

##### **ë„˜íŒŒì´**

ğŸ“ ë„˜íŒŒì´ ndarray ê°œìš”

In [29]:
import numpy as np

In [2]:
array1 = np.array([1, 2, 3])
print('array1 type: ', type(array1))
print('array1 array í˜•íƒœ: ', array1.shape)

array2 = np.array([[1, 3, 3], [2, 3, 4]])
print('array2 type: ', type(array2))
print('array2 array í˜•íƒœ: ', array2.shape)

array3 = np.array([[1, 2, 3]])
print('array3 type: ', type(array3))
print('array3 array í˜•íƒœ: ', array3.shape)

array1 type:  <class 'numpy.ndarray'>
array1 array í˜•íƒœ:  (3,)
array2 type:  <class 'numpy.ndarray'>
array2 array í˜•íƒœ:  (2, 3)
array3 type:  <class 'numpy.ndarray'>
array3 array í˜•íƒœ:  (1, 3)

In [3]:
print('array 1: {:0}ì°¨ì›, array2: {:1}ì°¨ì›, array3: {:2}ì°¨ì›'.format(array1.ndim, array2.ndim, array3.ndim))

array1: 1ì°¨ì›, array2: 2ì°¨ì›, array3:  2ì°¨ì›

ğŸ“ ndarrayì˜ ë°ì´í„° íƒ€ì…

In [5]:
list1 = [1, 2, 3]
print(type(list1))
array1 = np.array(list1)
print(type(array1))
print(array1, array1.dtype)

<class 'list'>
<class 'numpy.ndarray'>
[1 2 3] int64

In [6]:
list2 = [1, 2, 'test']
array2 = np.array(list2)
print(array2, array2.dtype)
list3 = [1, 2, 3.0]
array3 = np.array(list3)
print(array3, array3.dtype)

['1' '2' 'test'] <U21
[1. 2. 3.] float64

In [7]:
array_int = np.array([1, 2, 3])
array_float = array_int.astype('float64')
print(array_float, array_float.dtype)

array_int1 = array_float.astype('int32')
print(array_int1, array_int1.dtype)

array_float1 = np.array([1.1, 2.1, 3.1])
array_int2 = array_float1.astype('int32')
print(array_int2, array_int2.dtype)

[1. 2. 3.] float64
[1 2 3] int32
[1 2 3] int32

ğŸ“ ndarrayë¥¼ í¸ë¦¬í•˜ê²Œ ìƒì„±í•˜ê¸° - arange, zeros, ones

In [9]:
sequence_array = np.arange(10)
print(sequence_array)
print(sequence_array.dtype, sequence_array.shape)

[0 1 2 3 4 5 6 7 8 9]
int64 (10,)

In [11]:
zero_array = np.zeros((3, 2), dtype='int32')
print(zero_array)
print(zero_array.dtype, zero_array.shape)

one_array = np.ones((3, 2))
print(one_array)
print(one_array.dtype, one_array.shape)

[[0 0]
 [0 0]
 [0 0]]
int32 (3, 2)
[[1. 1.]
 [1. 1.]
 [1. 1.]]
float64 (3, 2)

ğŸ“ ndarrayì˜ ì°¨ì›ê³¼ í¬ê¸°ë¥¼ ë³€ê²½í•˜ëŠ” reshape()

In [13]:
array1 = np.arange(10)
print('array1:\n', array1)

array2 = array1.reshape(2, 5)
print('array2:\n', array2)

array3 = array1.reshape(5, 2)
print('array3:/n', array3)

array1:
 [0 1 2 3 4 5 6 7 8 9]
array2:
 [[0 1 2 3 4]
 [5 6 7 8 9]]
array3:/n [[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]

In [14]:
array1 = np.arange(10)
print(array1)
array2 = array1.reshape(-1, 5)
print('array2 shape: ', array2.shape)
array3 = array1.reshape(5, -1)
print('array3 shape: ', array3.shape)

[0 1 2 3 4 5 6 7 8 9]
array2 shape:  (2, 5)
array3 shape:  (5, 2)

In [16]:
array1 = np.arange(8)
array3d = array1. reshape((2, 2, 2))
print('array3d:\n', array3d.tolist())

# 3ì°¨ì› ndarrayë¥¼ 2ì°¨ì› ndarrayë¡œ ë³€í™˜
array5 = array3d.reshape(-1, 1)
print('array5:\n', array5.tolist())
print('array5 shape: ', array5.shape)

#1ì°¨ì› ndarrayë¥¼ 2ì°¨ì› ndarrayë¡œ ë³€í™˜
array6 = array1.reshape(-1, 1)
print('array6:\n', array6.tolist())
print('array6 shape: ', array6.shape)

array3d:
 [[[0, 1], [2, 3]], [[4, 5], [6, 7]]]
array5:
 [[0], [1], [2], [3], [4], [5], [6], [7]]
array5 shape:  (8, 1)
array6:
 [[0], [1], [2], [3], [4], [5], [6], [7]]
array6 shape:  (8, 1)

ğŸ“ ë„˜íŒŒì´ì˜ ndarrayì˜ ë°ì´í„° ì„¸íŠ¸ ì„ íƒí•˜ê¸° - ì¸ë±ì‹±(Indexing)

In [17]:
# 1ë¶€í„° 9ê¹Œì§€ì˜ 1ì°¨ì› ndarray ìƒì„±
array1 = np.arange(start=1, stop=10)
print('array1: ', array1)
# indexëŠ” 0ë¶€í„° ì‹œì‘í•˜ë¯€ë¡œ array1[2]ëŠ” 3ë²ˆì§¸ index ìœ„ì¹˜ì˜ ë°ì´í„°ê°’ì„ ì˜ë¯¸
value = array1[2] 
print('value: ', value)
print(type(value))

array1:  [1 2 3 4 5 6 7 8 9]
value:  3
<class 'numpy.int64'>

In [21]:
print('ë§¨ ë’¤ì˜ ê°’: ', array1[-1], ', ë§¨ ë’¤ì—ì„œ ë‘ ë²ˆì§¸ ê°’: ', array1[-2])

ë§¨ ë’¤ì˜ ê°’:  9 , ë§¨ ë’¤ì—ì„œ ë‘ ë²ˆì§¸ ê°’:  8

In [22]:
array1[0] = 9
array1[8] = 0
print('array1: ', array1)

array1:  [9 2 3 4 5 6 7 8 0]

In [23]:
array1d = np.arange(start=1, stop=10)
array2d = array1d.reshape(3, 3)
print(array2d)

print('(row=1, col=0) index ê°€ë¦¬í‚¤ëŠ” ê°’: ', array2d[0, 0])
print('(row=0, col=1) index ê°€ë¦¬í‚¤ëŠ” ê°’: ', array2d[0, 1])
print('(row=1, col=0) index ê°€ë¦¬í‚¤ëŠ” ê°’: ', array2d[1, 0])
print('(row=2, col=2) index ê°€ë¦¬í‚¤ëŠ” ê°’: ', array2d[2, 2])

[[1 2 3]
 [4 5 6]
 [7 8 9]]
(row=1, col=0) index ê°€ë¦¬í‚¤ëŠ” ê°’:  1
(row=0, col=1) index ê°€ë¦¬í‚¤ëŠ” ê°’:  2
(row=1, col=0) index ê°€ë¦¬í‚¤ëŠ” ê°’:  4
(row=2, col=2) index ê°€ë¦¬í‚¤ëŠ” ê°’:  9

In [24]:
array1 = np.arange(start=1, stop=10)
array3 = array1[0:3]
print(array3)
print(type(array3))

[1 2 3]
<class 'numpy.ndarray'>

In [26]:
array1 = np.arange(start=1, stop=10)
array4 = array1[:3]
print(array4)

array5 = array1[3:]
print(array5)

array6 = array1[:]
print(array6)

[1 2 3]
[4 5 6 7 8 9]
[1 2 3 4 5 6 7 8 9]

In [32]:
array1d = np.arange(start=1, stop=10)
array2d = array1d.reshape(3, 3)
print('array2d:\n', array2d)

print('array2d[0:2, 0:2]\n', array2d[0:2, 0:2])
print('array2d[1:3, 0:3]\n', array2d[1:3, 0:3])
print('array2d[1:3, :]\n', array2d[1:3, :])
print('array2d[:, :]\n', array2d[:, :])
print('array2d[:2, 1:]\n', array2d[:2, 1:])
print('array2d[:2, 0]\n', array2d[:2, 0])

array2d:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
array2d[0:2, 0:2]
 [[1 2]
 [4 5]]
array2d[1:3, 0:3]
 [[4 5 6]
 [7 8 9]]
array2d[1:3, :]
 [[4 5 6]
 [7 8 9]]
array2d[:, :]
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
array2d[:2, 1:]
 [[2 3]
 [5 6]]
array2d[:2, 0]
 [1 4]

In [33]:
print(array2d[0])
print(array2d[1])
print('array2d[0] shape:', array2d[0].shape, 'array2d[1] shape: ', array2d[1].shape)

[1 2 3]
[4 5 6]
array2d[0] shape: (3,) array2d[1] shape:  (3,)

In [35]:
array1d = np.arange(start=1, stop=10)
array2d = array1d.reshape(3, 3)

array3 = array2d[[0, 1], 2]
print('array2d[[0, 1], 2] => ', array3.tolist())

array4 = array2d[[0, 1], 0:2]
print('array2d[[0, 1], 0:2] => ', array4.tolist())

array5 = array2d[[0, 1]]
print('array2d[[0, 1]] => ', array5.tolist())

array2d[[0, 1], 2] =>  [3, 6]
array2d[[0, 1], 0:2] =>  [[1, 2], [4, 5]]
array2d[[0, 1]] =>  [[1, 2, 3], [4, 5, 6]]

In [36]:
array1d = np.arange(start=1, stop=10)
array3 = array1d[array1d > 5]
print('array1d > 5 ë¶ˆë¦° ì¸ë±ì‹± ê²°ê³¼ ê°’ :', array3)

array1d > 5 ë¶ˆë¦° ì¸ë±ì‹± ê²°ê³¼ ê°’ : [6 7 8 9]

In [37]:
boolean_indexes = np.array([False, False, False, False, False, True, True, True, True])
array3 = array1d[boolean_indexes]
print('ë¶ˆë¦° ì¸ë±ìŠ¤ë¡œ í•„í„°ë§ ê²°ê³¼: ', array3)

ë¶ˆë¦° ì¸ë±ìŠ¤ë¡œ í•„í„°ë§ ê²°ê³¼:  [6 7 8 9]

In [38]:
indexes = np.array([5, 6, 7, 8])
array4 = array1d[indexes]
print('ì¼ë°˜ ì¸ë±ìŠ¤ë¡œ í•„í„°ë§ ê²°ê³¼: ', array4)

ì¼ë°˜ ì¸ë±ìŠ¤ë¡œ í•„í„°ë§ ê²°ê³¼:  [6 7 8 9]

ğŸ“ í–‰ë ¬ì˜ ì •ë ¬ - sort()ì™€ argsort()

In [42]:
org_array = np.array([3, 1, 9, 5])
print('ì›ë³¸ í–‰ë ¬: ', org_array)
sort_array1 = np.sort(org_array)
print('np.sort() í˜¸ì¶œ í›„ ë°˜í™˜ëœ ì •ë ¬ í–‰ë ¬: ', sort_array1)
print('np.sort() í˜¸ì¶œ í›„ ì›ë³¸ í–‰ë ¬: ', org_array)
sort_array2 = org_array.sort()
print('org_array.sort() í˜¸ì¶œ í›„ ë°˜í™˜ëœ í–‰ë ¬: ', sort_array2)
print('ort_array.sort() í˜¸ì¶œ í›„ ì›ë³¸ í–‰ë ¬: ', org_array)

ì›ë³¸ í–‰ë ¬:  [3 1 9 5]
np.sort() í˜¸ì¶œ í›„ ë°˜í™˜ëœ ì •ë ¬ í–‰ë ¬:  [1 3 5 9]
np.sort() í˜¸ì¶œ í›„ ì›ë³¸ í–‰ë ¬:  [3 1 9 5]
org_array.sort() í˜¸ì¶œ í›„ ë°˜í™˜ëœ í–‰ë ¬:  None
ort_array.sort() í˜¸ì¶œ í›„ ì›ë³¸ í–‰ë ¬:  [1 3 5 9]

In [43]:
sort_array1_desc = np.sort(org_array)[::-1]
print('ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬: ', sort_array1_desc)

ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬:  [9 5 3 1]

In [45]:
array2d = np.array([[8, 12], [7, 1], [9, 6]])

sort_array2d_axis0 = np.sort(array2d, axis=0)
print('ë¡œìš° ë°©í–¥ìœ¼ë¡œ ì •ë ¬:\n', sort_array2d_axis0)

sort_array2d_axis1 = np.sort(array2d, axis=1)
print('ì¹¼ëŸ¼ ë°©í–¥ìœ¼ë¡œ ì •ë ¬:\n', sort_array2d_axis1)

ë¡œìš° ë°©í–¥ìœ¼ë¡œ ì •ë ¬:
 [[ 7  1]
 [ 8  6]
 [ 9 12]]
ì¹¼ëŸ¼ ë°©í–¥ìœ¼ë¡œ ì •ë ¬:
 [[ 8 12]
 [ 1  7]
 [ 6  9]]

In [46]:
org_array = np.array([3, 1, 9, 5])
sort_indices = np.argsort(org_array)
print(type(sort_indices))
print('í–‰ë ¬ ì •ë ¬ ì‹œ ì›ë³¸ í–‰ë ¬ì˜ ì¸ë±ìŠ¤: ', sort_indices)

<class 'numpy.ndarray'>
í–‰ë ¬ ì •ë ¬ ì‹œ ì›ë³¸ í–‰ë ¬ì˜ ì¸ë±ìŠ¤:  [1 0 3 2]

In [47]:
org_array = np.array([3, 1, 9, 5])
sort_indices_desc = np.argsort(org_array)[::-1]
print('í–‰ë ¬ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬ ì‹œ ì›ë³¸ í–‰ë ¬ì˜ ì¸ë±ìŠ¤: ', sort_indices_desc)

í–‰ë ¬ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬ ì‹œ ì›ë³¸ í–‰ë ¬ì˜ ì¸ë±ìŠ¤:  [2 3 0 1]

ğŸ“ ì„ í˜•ëŒ€ìˆ˜ ì—°ì‚° - í–‰ë ¬ ë‚´ì ê³¼ ì „ì¹˜ í–‰ë ¬ êµ¬í•˜ê¸°

In [48]:
A = np.array([[1, 2, 3], [4, 5, 6]])
B = np.array([[7, 8], [9, 10], [11, 12]])
dot_product = np.dot(A, B)
print('í–‰ë ¬ ë‚´ì  ê²°ê³¼:\n', dot_product)

í–‰ë ¬ ë‚´ì  ê²°ê³¼:
 [[ 58  64]
 [139 154]]

In [49]:
A = np.array([[1, 2], [3, 4]])
transpose_mat = np.transpose(A)
print('Aì˜ ì „ì¹˜ í–‰ë ¬:\n', transpose_mat)

Aì˜ ì „ì¹˜ í–‰ë ¬:
 [[1 3]
 [2 4]]

##### **ë°ì´í„° í•¸ë“¤ë§ - íŒë‹¤ìŠ¤**

In [50]:
import pandas as pd

In [54]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic ë³€ìˆ˜ type: ', type(titanic_df))
# titanic_df
titanic_df.head(3)

titanic ë³€ìˆ˜ type:  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [55]:
print('DataFrame í¬ê¸°: ', titanic_df.shape)

DataFrame í¬ê¸°:  (891, 12)

In [56]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [58]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [59]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [60]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [61]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [62]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

ğŸ“ DataFrameê³¼ ë¦¬ìŠ¤íŠ¸, ë”•ì…”ë„ˆë¦¬, ë„˜íŒŒì´ ndarray ìƒí˜¸ ë³€í™˜

In [66]:
import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print('array1 shape: ', array1.shape)
# ë¦¬ìŠ¤íŠ¸ë¥¼ ì´ìš©í•´ DataFrame ìƒì„±
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¡œ ë§Œë“  DataFrame:\n',df_list1)
# ë„˜íŒŒì´ ndarrayë¥¼ ì´ìš©í•´ DataFrame ìƒì„±
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1ì°¨ì› ndarrayë¡œ ë§Œë“  DataFrame:\n',df_array1)

array1 shape:  (3,)
1ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¡œ ë§Œë“  DataFrame:
    col1
0     1
1     2
2     3
1ì°¨ì› ndarrayë¡œ ë§Œë“  DataFrame:
    col1
0     1
1     2
2     3

In [67]:
# 3ê°œì˜ ì¹¼ëŸ¼ëª…ì´ í•„ìš”
col_name2 = ['col1', 'col2', 'col3']

# 2í–‰ X 3ì—´ í˜•íƒœì˜ ë¦¬ìŠ¤íŠ¸ì™€ ndarray ìƒì„±í•œ ë’¤ ì´ë¥¼ DataFrameìœ¼ë¡œ ë³€í™˜
list2 = [[1, 2, 3], [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape: ', array2.shape)
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¡œ ë§Œë“  DataFrame:\n', df_list2)
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2ì°¨ì› ndarrayë¡œ ë§Œë“  DataFrame:\n', df_array2)

array2 shape:  (2, 3)
2ì°¨ì› ë¦¬ìŠ¤íŠ¸ë¡œ ë§Œë“  DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2ì°¨ì› ndarrayë¡œ ë§Œë“  DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [68]:
# KeyëŠ” ë¬¸ìì—´ ì¹¼ëŸ¼ëª…ìœ¼ë¡œ ë§¤í•‘, ValueëŠ” ë¦¬ìŠ¤íŠ¸ í˜•(ë˜ëŠ” ndarray) ì¹¼ëŸ¼ ë°ì´í„°ë¡œ ë§¤í•‘
dict = {'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}
df_dict = pd.DataFrame(dict)
print('ë”•ì…”ë„ˆë¦¬ë¡œ ë§Œë“  DataFrame:\n', df_dict)

ë”•ì…”ë„ˆë¦¬ë¡œ ë§Œë“  DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [69]:
# DataFrameì„ ndarrayë¡œ ë³€í™˜
array3 = df_dict.values
print('df_dict.values íƒ€ì…: ', type(array3), 'df_dict.values shape: ', array3.shape)
print(array3)

df_dict.values íƒ€ì…:  <class 'numpy.ndarray'> df_dict.values shape:  (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [70]:
# DataFrameì„ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() íƒ€ì…: ', type(list3))
print(list3)

# DataFrameì„ ë”•ì…”ë„ˆë¦¬ë¡œ ë³€í™˜
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() íƒ€ì…: ', type(dict3))
print(dict3)

df_dict.values.tolist() íƒ€ì…:  <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() íƒ€ì…:  <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

ğŸ“ DataFrameì˜ ì¹¼ëŸ¼ ë°ì´í„° ì„¸íŠ¸ ìƒì„±ê³¼ ìˆ˜ì •

In [71]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [73]:
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [74]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

ğŸ“ DataFrame ë°ì´í„° ì‚­ì œ

In [77]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)
# titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [78]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print('inplace=Trueë¡œ drop í›„ ë°˜í™˜ëœ ê°’: ', drop_result)
titanic_df.head(3)

inplace=Trueë¡œ drop í›„ ë°˜í™˜ëœ ê°’:  None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [84]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

In [86]:
titanic_df.drop([3, 4], axis=0, inplace=True)
print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
5            6         0       3  Moran, Mr. ...  male   NaN      0      0  330877   8.4583   NaN        Q
6            7         0       1  McCarthy, M...  male  54.0      0      0   17463  51.8625   E46        S
7            8         0       3  Palsson, Ma...  male   2.0      3      1  349909  21.0750   NaN        S

ğŸ“ Index ê°ì²´

In [87]:
# ì›ë³¸ íŒŒì¼ ë‹¤ì‹œ ë¡œë”©
titanic_df = pd.read_csv('titanic_train.csv')
# Index ê°ì²´ ì¶”ì¶œ
indexes = titanic_df.index
print(indexes)
# Index ê°ì²´ë¥¼ ì‹¤ì œ ê°’ arrayë¡œ ë³€í™˜
print('Index ê°ì²´ arrayê°’:\n', indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index ê°ì²´ arrayê°’:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [88]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [91]:
series_fair = titanic_df['Fare']
print('Fair Series max ê°’: ', series_fair.max())
print('Fair Series sum ê°’: ', series_fair.sum())
print('sum() Fair Series: ', sum(series_fair))
print('Fair Series + 3:\n', (series_fair+3).head(3))

Fair Series max ê°’:  512.3292
Fair Series sum ê°’:  28693.9493
sum() Fair Series:  28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [92]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [93]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…: ', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print('new_value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…: ', type(new_value_counts))

### before reset_index ###
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…:  <class 'pandas.core.series.Series'>
### After reset_index ###
   Pclass  count
0       3    491
1       1    216
2       2    184
new_value_counts ê°ì²´ ë³€ìˆ˜ íƒ€ì…:  <class 'pandas.core.frame.DataFrame'>

ğŸ“ ë°ì´í„° ì…€ë ‰ì…˜ ë° í•„í„°ë§

In [94]:
print('ë‹¨ì¼ ì¹¼ëŸ¼ ë°ì´í„° ì¶”ì¶œ:\n', titanic_df['Pclass'].head(3))
print('\nì—¬ëŸ¬ ì¹¼ëŸ¼ì˜ ë°ì´í„° ì¶”ì¶œ:\n', titanic_df[['Survived', 'Pclass']].head(3))
print('[] ì•ˆì— ìˆ«ì indexëŠ” keyError ì˜¤ë¥˜ ë°œìƒ:\n', titanic_df[0])

ë‹¨ì¼ ì¹¼ëŸ¼ ë°ì´í„° ì¶”ì¶œ:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

ì—¬ëŸ¬ ì¹¼ëŸ¼ì˜ ë°ì´í„° ì¶”ì¶œ:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [95]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [96]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

(ì°¸ê³ ) í˜„ì¬ ix[] ì§€ì›ë˜ì§€ ì•ŠìŒ. ê´€ë ¨ ì˜ˆì œ ì½”ë“œ ìƒëµ.

In [101]:
data = {'Name': ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']}
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [107]:
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns = {'index':'old_index'})
data_df_reset.index = data_df_reset.index+1
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

In [102]:
data_df.iloc[0, 0]

'Chulmin'

In [105]:
data_df.iloc[0, 'Name'] # ì˜¤ë¥˜

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [104]:
data_df.iloc['one', 0] # ì˜¤ë¥˜

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [108]:
data_df_reset.iloc[0, 1]

'Chulmin'

In [109]:
data_df.loc['one', 'Name']

'Chulmin'

In [111]:
data_df_reset.loc[1, 'Name']

'Chulmin'

In [112]:
data_df_reset.loc[0, 'Name'] # ì˜¤ë¥˜

KeyError: 0

In [113]:
print('ìœ„ì¹˜ ê¸°ë°˜ iloc slicing\n', data_df.iloc[0:1, 0], '\n')
print('ëª…ì¹­ ê¸°ë°˜ loc slicing\n', data_df.loc['one':'two', 'Name'])

ìœ„ì¹˜ ê¸°ë°˜ iloc slicing
 one    Chulmin
Name: Name, dtype: object

ëª…ì¹­ ê¸°ë°˜ loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [114]:
print(data_df_reset.loc[1:2, 'Name'])

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

In [115]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [116]:
titanic_df[titanic_df['Age']>60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [117]:
titanic_df.loc[titanic_df['Age']>60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [118]:
titanic_df[(titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [119]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1&cond2&cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

ğŸ“ ì •ë ¬, Aggregation í•¨ìˆ˜, GroupBy ì ìš©

In [120]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [121]:
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending = False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

In [122]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [123]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [131]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [125]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [132]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [133]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [135]:
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

ğŸ“ ê²°ì† ë°ì´í„° ì²˜ë¦¬í•˜ê¸°

In [136]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [137]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [138]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [139]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

ğŸ“ apply lambda ì‹ìœ¼ë¡œ ë°ì´í„° ê°€ê³µ

In [140]:
def get_square(a):
    return a**2
print('3ì˜ ì œê³±ì€: ', get_square(3))

3ì˜ ì œê³±ì€:  9

In [141]:
lambda_square = lambda x : x ** 2
print('3ì˜ ì œê³±ì€: ', lambda_square(3))

3ì˜ ì œê³±ì€:  9

In [143]:
a = [1, 2, 3]
squares = map(lambda x : x ** 2, a)
list(squares)

[1, 4, 9]

In [146]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [145]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [147]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Age_cat
Adult      786
Child       83
Elderly     22
Name: count, dtype: int64

In [149]:
# ë‚˜ì´ì— ë”°ë¼ ì„¸ë¶„í™”ëœ ë¶„ë¥˜ë¥¼ ìˆ˜í–‰í•˜ëŠ” í•¨ìˆ˜ ìƒì„±
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    return cat
# lambda ì‹ì— ìœ„ì—ì„œ ìƒì„±í•œ get_category() í•¨ìˆ˜ë¥¼ ë°˜í™˜ê°’ìœ¼ë¡œ ì§€ì •
# get_category(x)ëŠ” ì…ë ¥ê°’ìœ¼ë¡œ 'Age' ì¹¼ëŸ¼ ê°’ì„ ë°›ì•„ì„œ í•´ë‹¹í•˜ëŠ” cat ë°˜í™˜
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult